app/Controllers/Auth.php

                // Get admin-specific stats
                $data['stats'] = [
                    'total_users'       => $db->table('users')->countAllResults(),
                    'active_users'      => $db->table('users')->where('is_active', 1)->countAllResults(),
                    'total_students'    => $db->table('users')->where('role', 'student')->countAllResults(),
                    'total_teachers'    => $db->table('users')->where('role', 'teacher')->countAllResults(),
                    'total_courses'     => $db->table('courses')->countAllResults(),
                    'total_enrollments' => $db->table('enrollments')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `enrollments`

                $data['recent_activity'] = $recentActivity;

                // Get all courses for materials upload dropdown
                $data['admin_courses'] = $db->table('courses')
                    ->orderBy('title', 'ASC')
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `courses`
ORDER BY `title` ASC