app/Controllers/Auth.php

    public function dashboard()
    {
        // This will automatically redirect to login if not authenticated
        $this->requireLogin();

        $db = \Config\Database::connect();
        $userId = $this->userData['id'];
        $role = $this->userData['role'];

        $data = [
            'title' => 'Dashboard',
            'user' => $this->userData
        ];

        // Add role-specific data
        switch ($role) {
            case 'admin':
                // Get admin-specific data
                $data['stats'] = [
                    'total_users' => $db->table('users')->countAllResults(),
                    'total_courses' => $db->table('courses')->countAllResults(),
                    'total_enrollments' => $db->table('enrollments')->countAllResults(),
                    'recent_users' => $db->table('users')
                                      ->orderBy('created_at', 'DESC')
                                      ->limit(5)
                                      ->get()
                                      ->getResultArray()
                ];
---
SELECT *
FROM `courses`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5


            case 'teacher':
                // Get teacher-specific data
                $data['courses'] = $db->table('courses')
                    ->where('teacher_id', $userId)
                    ->countAllResults();

                $data['students'] = $db->table('enrollments')
                    ->select('enrollments.student_id')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('courses.teacher_id', $userId)
                    ->groupBy('enrollments.student_id')
                    ->countAllResults();

                $data['recent_courses'] = $db->table('courses')
                    ->where('teacher_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit(3)
                    ->get()
                    ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `teacher_id` = '3'
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `enrollments`.`student_id`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `courses`.`teacher_id` = '3'
GROUP BY `enrollments`.`student_id`
) CI_count_all_results
SELECT *
FROM `courses`
WHERE `teacher_id` = '3'
ORDER BY `created_at` DESC
 LIMIT 3


            case 'student':
                // Get student-specific data
                $data['enrolled_courses'] = $db->table('enrollments')
                    ->where('student_id', $userId)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `student_id` = '2'

                // Initialize completed lessons to 0 since we don't have the user_progress table
                $data['completed_lessons'] = 0;

                $data['recent_courses'] = $db->table('enrollments')
                    ->select('courses.*')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.student_id', $userId)
                    ->orderBy('enrollments.enrolled_at', 'DESC')
                    ->limit(3)
                    ->get()
                    ->getResultArray();
---
SELECT `courses`.*
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`student_id` = '2'
ORDER BY `enrollments`.`enrolled_at` DESC
 LIMIT 3