app/Controllers/Course.php

INSERT INTO `courses` (`title`, `description`, `teacher_id`, `status`, `created_at`, `updated_at`) VALUES ('bagong course', 'awdawdawdawd', '2', 'active', '2025-11-27 17:07:39', '2025-11-27 17:07:39')
---
    public function store()
    {
        if (!$this->isLoggedIn() || !$this->hasRole('admin')) {
            return redirect()->to('/dashboard')->with('error', 'Unauthorized access');
        }

        $rules = [
            'title' => 'required|min_length[3]|max_length[255]',
            'description' => 'required|min_length[10]',
            'teacher_id' => 'required|numeric',
            'status' => 'required|in_list[active,inactive]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'teacher_id' => $this->request->getPost('teacher_id'),
            'status' => $this->request->getPost('status'),
            'created_at' => date('Y-m-d H:i:s')
        ];

        if ($this->courseModel->insert($data)) {

SELECT `courses`.`id`, `courses`.`title`, `courses`.`status`, `courses`.`created_at`, `users`.`name` as `teacher_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
WHERE   (
`courses`.`title` LIKE '%data%' ESCAPE '!'
OR  `courses`.`description` LIKE '%data%' ESCAPE '!'
OR  `users`.`name` LIKE '%data%' ESCAPE '!'
 )
ORDER BY `courses`.`created_at` DESC
---
    public function search()
    {
        if (!$this->isLoggedIn() || !$this->hasRole('admin')) {
            return $this->response->setStatusCode(403)->setJSON([
                'status' => 'error',
                'message' => 'Unauthorized access'
            ]);
        }

        $term = trim((string) $this->request->getVar('term'));

        if ($term === '') {
            return $this->response->setJSON([]);
        }

        $builder = $this->courseModel
            ->select('courses.id, courses.title, courses.status, courses.created_at, users.name as teacher_name')
            ->join('users', 'users.id = courses.teacher_id', 'left')
            ->groupStart()
                ->like('courses.title', $term)
                ->orLike('courses.description', $term)
                ->orLike('users.name', $term)
            ->groupEnd()
            ->orderBy('courses.created_at', 'DESC');