app/Controllers/Student.php

SELECT `courses`.*, `enrollments`.`enrollment_date`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '2'
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function courses()
    {
        // Require authentication
        if (!$this->isLoggedIn()) {
            return redirect()->to('/login')->with('error', 'Please login to continue');
        }

        // Require student role
        if (!$this->hasRole('student')) {
            return redirect()->to('/dashboard')->with('error', 'You do not have access to this page');
        }

        $db = \Config\Database::connect();
        $userId = $this->userData['id'];

        // Get all enrolled courses
        $enrolledCourses = $db->table('enrollments')
            ->select('courses.*, enrollments.enrollment_date')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->where('enrollments.user_id', $userId)
            ->orderBy('enrollments.enrollment_date', 'DESC')
            ->get()
            ->getResultArray();