app/Controllers/Teacher.php

SELECT `enrollments`.`enrollment_date`, `users`.`id` as `student_id`, `users`.`name` as `student_name`, `users`.`email` as `student_email`, `courses`.`id` as `course_id`, `courses`.`title` as `course_title`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `courses`.`teacher_id` = '3'
ORDER BY `courses`.`title` ASC, `users`.`name` ASC
---
    public function students()
    {
        if (!$this->isLoggedIn() || !$this->hasRole('teacher')) {
            return redirect()->to('/dashboard')->with('error', 'Unauthorized access');
        }

        $teacherId = $this->userData['id'];
        $db = \Config\Database::connect();

        $students = $db->table('enrollments')
            ->select('enrollments.enrollment_date, users.id as student_id, users.name as student_name, users.email as student_email, courses.id as course_id, courses.title as course_title')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->join('users', 'users.id = enrollments.user_id')
            ->where('courses.teacher_id', $teacherId)
            ->orderBy('courses.title', 'ASC')
            ->orderBy('users.name', 'ASC')
            ->get()
            ->getResultArray();