app/Models/CourseModel.php

    public function getAllCoursesWithTeacher()
    {
        return $this->select('courses.*, users.name as teacher_name')
                   ->join('users', 'users.id = courses.teacher_id')
                   ->orderBy('courses.created_at', 'DESC')
                   ->findAll();
---
SELECT `courses`.*, `users`.`name` as `teacher_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`teacher_id`
ORDER BY `courses`.`created_at` DESC

    public function getCoursesByTeacher($teacherId)
    {
        return $this->where('teacher_id', $teacherId)
                   ->orderBy('created_at', 'DESC')
                   ->findAll();
---
SELECT *
FROM `courses`
WHERE `teacher_id` = '3'
ORDER BY `created_at` DESC