app/Models/MaterialModel.php

    public function getMaterialsByCourse(int $course_id): array
    {
        return $this->where('course_id', $course_id)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = 8
ORDER BY `created_at` DESC